<template>
  <footer class="footer">
    <div class="footer__left">
      <div class="play">
        <div class="play__age">
          <span> 18+ </span>
        </div>
        <p>PLAY REPSPONSIBLY</p>
      </div>
      <p>
        BLOXMARKET is not affiliated, associated, or partnered with UpliftGames
        LLC and Roblox Corporation in any way.
      </p>
    </div>
    <div class="footer__center">
      <div class="about">
        <h5>© 2018 – 2024 BLOX MARKET</h5>

        <p>
          AG AUTOMOTIVE LOGISTICS AND MANAGEMENT PTE. LTD.: Company number
          00000, 00 CIRCULAR ROAD #02-01 SINGAPORE (0000)
        </p>
      </div>
      <div class="menu">
        <ul class="menu__items">
          <li class="menu__item">
            <a class="menu__link" href="#">Пользовательское соглашение</a>
          </li>
          <li class="menu__item">
            <a class="menu__link" href="#">Контакты</a>
          </li>
          <li class="menu__item">
            <a class="menu__link" href="#">Privacy Policy</a>
          </li>
          <li class="menu__item">
            <a class="menu__link" href="#">Provably fair</a>
          </li>
          <li class="menu__item">
            <a class="menu__link" href="#">Поддержка</a>
          </li>
        </ul>
      </div>
    </div>
    <div class="footer__right">
      <div class="socials">
        <ul class="socials__icons">
          <li class="socials__icon">
            <a class="socials__link" href="#">
              <svg
                width="21"
                height="20"
                viewBox="0 0 21 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M1.48211 1.84584C1.84394 1.50588 2.27535 1.24776 2.77634 1.07148C3.26342 0.895208 3.84791 0.76615 4.52982 0.684307C5.21173 0.602465 6.00497 0.548952 6.90954 0.523769C7.81412 0.511179 8.85089 0.504883 10.0199 0.504883H10.9384C12.1213 0.504883 13.165 0.511179 14.0696 0.523769C14.9742 0.548952 15.7674 0.602465 16.4493 0.684307C17.1312 0.76615 17.7227 0.895208 18.2237 1.07148C18.7247 1.24776 19.1561 1.50588 19.5179 1.84584C19.8936 2.17321 20.1789 2.56353 20.3738 3.01681C20.5686 3.4575 20.7112 3.98633 20.8017 4.60329C20.8921 5.22026 20.9513 5.93795 20.9791 6.75637C20.993 7.5748 21 8.51284 21 9.57049V10.4015C21 11.4717 20.993 12.4161 20.9791 13.2345C20.9513 14.0529 20.8921 14.7738 20.8017 15.397C20.7112 16.0203 20.5686 16.5586 20.3738 17.0118C20.1789 17.4525 19.8936 17.8429 19.5179 18.1828C19.1561 18.5102 18.7316 18.762 18.2445 18.9383C17.7575 19.1146 17.1799 19.2468 16.5119 19.3349C15.8439 19.423 15.0716 19.4734 14.1948 19.486C13.3042 19.4986 12.2883 19.5049 11.1471 19.5049C11.1054 19.5049 11.0671 19.5049 11.0323 19.5049C10.9975 19.5049 10.9662 19.5049 10.9384 19.5049H10.0616C8.87873 19.5049 7.83499 19.4986 6.93042 19.486C6.02585 19.4608 5.2326 19.4073 4.5507 19.3255C3.86879 19.2436 3.27734 19.1146 2.77634 18.9383C2.27535 18.762 1.84394 18.5039 1.48211 18.1639C1.10636 17.8366 0.821074 17.4462 0.626243 16.993C0.431412 16.5523 0.288767 16.0234 0.19831 15.4065C0.107853 14.7895 0.0487078 14.0718 0.0208748 13.2534C0.00695825 12.435 0 11.4969 0 10.4393V9.60826C0 8.53802 0.00695825 7.59368 0.0208748 6.77526C0.0487078 5.95684 0.107853 5.23914 0.19831 4.62218C0.288767 4.00521 0.431412 3.47009 0.626243 3.01681C0.821074 2.56353 1.10636 2.17321 1.48211 1.84584ZM3.54871 6.28421C3.57654 7.51814 3.76441 8.62615 4.11233 9.60826C4.46024 10.5778 4.95775 11.4025 5.60487 12.0824C6.25199 12.7623 7.04175 13.2849 7.97415 13.65C8.90656 14.0152 9.97117 14.1977 11.168 14.1977H11.4394V11.3647C11.8708 11.4151 12.2778 11.519 12.6605 11.6764C13.0432 11.8337 13.4016 12.0383 13.7356 12.2902C14.0557 12.542 14.327 12.8316 14.5497 13.159C14.7724 13.4863 14.9463 13.8326 15.0716 14.1977H17.5557C17.4304 13.7696 17.2565 13.3604 17.0338 12.9701C16.8111 12.5798 16.5398 12.2146 16.2197 11.8747C15.9135 11.5347 15.5691 11.2262 15.1864 10.9492C14.8037 10.6722 14.3966 10.4393 13.9652 10.2504C14.3549 10.0238 14.7167 9.7688 15.0507 9.4855C15.3847 9.2022 15.6839 8.89057 15.9483 8.55061C16.2127 8.21065 16.4354 7.84865 16.6163 7.46462C16.7972 7.0806 16.9294 6.68712 17.0129 6.28421H14.7585C14.5219 7.06486 14.0835 7.76366 13.4433 8.38063C12.8032 8.99759 12.1352 9.34385 11.4394 9.4194V6.28421H9.18489V11.7613C8.83698 11.6732 8.47515 11.5095 8.0994 11.2703C7.72366 11.0311 7.37922 10.6911 7.0661 10.2504C6.75298 9.80972 6.49205 9.26201 6.2833 8.60727C6.07455 7.96512 5.96322 7.19077 5.9493 6.28421H3.54871Z"
                  fill="#ECF0F9"
                />
              </svg>
            </a>
          </li>
          <li class="socials__icon">
            <a class="socials__link" href="#">
              <svg
                width="24"
                height="20"
                viewBox="0 0 24 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M9.42109 13.0189L9.02271 18.3275C9.30392 18.3275 9.52264 18.2761 9.67886 18.1733C9.83509 18.0705 9.98351 17.9531 10.1241 17.8209L12.7956 15.3979L18.3026 19.2307C18.8181 19.5097 19.2478 19.5758 19.5915 19.4289C19.9352 19.2821 20.1773 18.9223 20.3179 18.3496L23.9268 2.22528C24.083 1.5204 23.9893 1.03212 23.6456 0.760441C23.3019 0.488766 22.8879 0.433697 22.4036 0.595234L1.12544 8.34899C0.391168 8.61332 0.0162236 8.91069 0.000600873 9.24111C-0.0150218 9.57153 0.273998 9.82484 0.867661 10.0011L6.30436 11.6091L18.9587 4.09764C19.2556 3.90673 19.4977 3.84432 19.6852 3.9104C19.8727 3.97649 19.8571 4.10498 19.6383 4.29589L9.42109 13.0189Z"
                  fill="#ECF0F9"
                />
              </svg>
            </a>
          </li>
          <li class="socials__icon">
            <a class="socials__link" href="#">
              <svg
                width="24"
                height="18"
                viewBox="0 0 24 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M20.3062 1.91269C19.5564 1.59394 18.7729 1.31504 17.9558 1.07598C17.1387 0.836914 16.2976 0.646549 15.4324 0.504883C15.4132 0.504883 15.3988 0.50931 15.3892 0.518164C15.3796 0.527018 15.3651 0.531445 15.3459 0.531445C15.2498 0.708529 15.144 0.90332 15.0287 1.11582C14.9133 1.32832 14.8172 1.52311 14.7403 1.7002C13.8175 1.57624 12.8994 1.51426 11.9862 1.51426C11.0729 1.51426 10.1645 1.57624 9.2609 1.7002C9.184 1.52311 9.08787 1.32832 8.97251 1.11582C8.85716 0.90332 8.75141 0.708529 8.65528 0.531445C8.63606 0.531445 8.62164 0.527018 8.61203 0.518164C8.60241 0.50931 8.58799 0.504883 8.56877 0.504883C7.7036 0.646549 6.86246 0.836914 6.04536 1.07598C5.22826 1.31504 4.43519 1.59394 3.66615 1.91269C3.66615 1.91269 3.66615 1.91712 3.66615 1.92598C3.66615 1.93483 3.65654 1.93926 3.63731 1.93926C2.86827 3.01947 2.23382 4.09082 1.73394 5.15332C1.21484 6.23353 0.820708 7.30046 0.551545 8.3541C0.282381 9.40775 0.109348 10.457 0.0324438 11.5018C-0.0252341 12.5465 -0.00600811 13.5913 0.0901217 14.6361C0.0901217 14.6538 0.0949282 14.6671 0.104541 14.676C0.114154 14.6848 0.128574 14.6893 0.1478 14.6893C1.16678 15.3799 2.17614 15.951 3.17589 16.4025C4.17564 16.8541 5.15616 17.2215 6.11746 17.5049C6.13668 17.5049 6.15591 17.5049 6.17514 17.5049C6.19436 17.5049 6.20398 17.496 6.20398 17.4783C6.43469 17.1773 6.65579 16.8718 6.86727 16.5619C7.07876 16.252 7.27102 15.9377 7.44405 15.6189C7.44405 15.6012 7.43924 15.5835 7.42963 15.5658C7.42002 15.5481 7.4056 15.5304 7.38637 15.5127C7.05953 15.4064 6.7423 15.2825 6.43469 15.1408C6.12707 14.9992 5.81946 14.8486 5.51184 14.6893C5.49262 14.6893 5.483 14.676 5.483 14.6494C5.483 14.6229 5.49262 14.6007 5.51184 14.583C5.56952 14.5299 5.632 14.4812 5.69929 14.4369C5.76658 14.3926 5.82907 14.3528 5.88675 14.3174C5.90597 14.2997 5.92039 14.2908 5.93001 14.2908C5.93962 14.2908 5.95404 14.2908 5.97326 14.2908C6.95379 14.7158 7.95354 15.0257 8.97251 15.2205C9.97226 15.433 10.9816 15.5393 12.0006 15.5393C13.0196 15.5393 14.0386 15.433 15.0575 15.2205C16.0573 15.0257 17.0474 14.7158 18.0279 14.2908C18.0279 14.2908 18.0375 14.2908 18.0568 14.2908C18.076 14.2908 18.0952 14.2997 18.1145 14.3174C18.1721 14.3528 18.2298 14.3926 18.2875 14.4369C18.3452 14.4812 18.4028 14.5299 18.4605 14.583C18.499 14.6007 18.5134 14.6229 18.5038 14.6494C18.4942 14.676 18.4797 14.6893 18.4605 14.6893C18.1721 14.8486 17.8693 14.9992 17.5521 15.1408C17.2349 15.2825 16.9128 15.4064 16.586 15.5127C16.5668 15.5304 16.5523 15.5481 16.5427 15.5658C16.5331 15.5835 16.5379 15.6012 16.5572 15.6189C16.7302 15.9377 16.9224 16.252 17.1339 16.5619C17.3454 16.8718 17.5569 17.1773 17.7684 17.4783C17.7876 17.496 17.802 17.5049 17.8116 17.5049C17.8213 17.5049 17.8357 17.5049 17.8549 17.5049C18.8354 17.2215 19.8256 16.8541 20.8253 16.4025C21.8251 15.951 22.8344 15.3799 23.8534 14.6893C23.8726 14.6893 23.8822 14.6848 23.8822 14.676C23.8822 14.6671 23.8822 14.6538 23.8822 14.6361C24.0168 13.432 24.036 12.2632 23.9399 11.1299C23.8438 10.0143 23.6419 8.92962 23.3343 7.87598C23.0267 6.82233 22.6229 5.79967 22.1231 4.80801C21.6232 3.81634 21.0272 2.86009 20.3351 1.93926C20.3351 1.93926 20.3351 1.93483 20.3351 1.92598C20.3351 1.91712 20.3254 1.91269 20.3062 1.91269ZM8.02083 12.1127C7.42482 12.1127 6.91534 11.8913 6.49236 11.4486C6.06939 11.0059 5.85791 10.4747 5.85791 9.85488C5.85791 9.23509 6.06939 8.70384 6.49236 8.26113C6.91534 7.81842 7.42482 7.59707 8.02083 7.59707C8.63606 7.59707 9.15035 7.81842 9.56371 8.26113C9.97707 8.70384 10.1837 9.23509 10.1837 9.85488C10.1837 10.4747 9.97226 11.0059 9.54929 11.4486C9.12632 11.8913 8.61683 12.1127 8.02083 12.1127ZM15.9804 12.1127C15.4036 12.1127 14.9037 11.8913 14.4807 11.4486C14.0578 11.0059 13.8463 10.4747 13.8463 9.85488C13.8463 9.23509 14.053 8.70384 14.4663 8.26113C14.8797 7.81842 15.3844 7.59707 15.9804 7.59707C16.5956 7.59707 17.1147 7.81842 17.5377 8.26113C17.9606 8.70384 18.1625 9.23509 18.1433 9.85488C18.1433 10.4747 17.9366 11.0059 17.5233 11.4486C17.1099 11.8913 16.5956 12.1127 15.9804 12.1127Z"
                  fill="#ECF0F9"
                />
              </svg>
            </a>
          </li>
          <li class="socials__icon">
            <a class="socials__link" href="#">
              <svg
                width="27"
                height="19"
                viewBox="0 0 27 19"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M26.3936 3.08354C26.6045 4.07792 26.7583 5.09337 26.855 6.12988C26.9517 7.1664 27 8.21556 27 9.27736C27 9.31106 27 9.34898 27 9.39112C27 9.43325 27 9.47118 27 9.50488C27 9.55544 27 9.59758 27 9.63129C27 9.665 27 9.6987 27 9.73241C27 10.7942 26.9517 11.8349 26.855 12.8546C26.7583 13.8743 26.6221 14.8307 26.4463 15.724L26.4199 15.7493C26.2617 16.2886 25.9761 16.7563 25.563 17.1524C25.1499 17.5484 24.6621 17.8223 24.0996 17.974C23.5547 18.1088 22.7021 18.2099 21.542 18.2774C20.3643 18.3616 19.1821 18.4206 17.9956 18.4543C16.8091 18.488 15.7676 18.5049 14.8711 18.5049C13.957 18.5049 13.5 18.5049 13.5 18.5049C13.5 18.5049 13.0518 18.5049 12.1553 18.5049C11.2588 18.5049 10.2129 18.488 9.01758 18.4543C7.82227 18.4206 6.64453 18.3616 5.48438 18.2774C4.30664 18.2099 3.4541 18.1088 2.92676 17.974C2.36426 17.8223 1.87646 17.5442 1.46338 17.1397C1.05029 16.7352 0.755859 16.2633 0.580078 15.724L0.632812 15.9262C0.421875 14.8981 0.263672 13.8448 0.158203 12.7661C0.0527344 11.6706 0 10.5835 0 9.50488C0 8.42623 0.0439453 7.36443 0.131836 6.31949C0.237305 5.25769 0.386719 4.24646 0.580078 3.28578V3.2605C0.755859 2.72118 1.05029 2.25348 1.46338 1.85741C1.87646 1.46134 2.36426 1.18747 2.92676 1.03578C3.47168 0.900951 4.32422 0.799828 5.48438 0.73241C6.66211 0.648142 7.84424 0.589153 9.03076 0.555445C10.2173 0.521736 11.2588 0.504883 12.1553 0.504883C13.0518 0.504883 13.5 0.504883 13.5 0.504883C13.5 0.504883 13.957 0.504883 14.8711 0.504883C15.7676 0.504883 16.8135 0.521736 18.0088 0.555445C19.2041 0.589153 20.3818 0.648142 21.542 0.73241C22.7197 0.799828 23.5635 0.900951 24.0732 1.03578H24.0996C24.6621 1.18747 25.1499 1.46134 25.563 1.85741C25.9761 2.25348 26.2705 2.7296 26.4463 3.28578L26.3936 3.08354ZM17.8506 9.50488L10.8105 5.63691V13.3729L17.8506 9.50488Z"
                  fill="#ECF0F9"
                />
              </svg>
            </a>
          </li>
        </ul>
      </div>
      <div class="language-switcher">
        <div class="language-toggle" @click="toggleDropdown">
          <!-- Динамическая картинка флага и текст в зависимости от выбранного языка -->
          <img
            :src="currentLanguageImage"
            alt="language"
            class="language-icon"
          />
          <span>{{ currentLanguageText }}</span>
          <!-- Стрелка, меняющаяся в зависимости от состояния dropdown -->
          <span :class="['arrow', { open: isDropdownOpen }]">
            <svg
              width="7"
              height="4"
              viewBox="0 0 7 4"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M6.45772 -3.01408e-07L0.543226 -1.33553e-06C0.303155 -1.37751e-06 0.137651 0.11607 0.0467144 0.348213C-0.0442218 0.580356 -0.00239119 0.785713 0.172206 0.964285L2.74752 3.67857C2.95849 3.89286 3.20948 4 3.50047 4C3.79147 4 4.04245 3.89286 4.25342 3.67857L6.83965 0.964286C7.00697 0.785714 7.04335 0.580357 6.94877 0.348214C6.8542 0.116071 6.69051 -2.60705e-07 6.45772 -3.01408e-07Z"
                fill="white"
              />
            </svg>
          </span>
        </div>

        <!-- Выпадающий список для выбора языка, показываем только не выбранный язык -->
        <div v-if="isDropdownOpen" class="language-dropdown">
          <div
            v-for="(language, key) in availableLanguages"
            :key="key"
            class="language-option"
            @click="selectLanguage(key)"
          >
            <img :src="language.image" alt="language" class="language-icon" />
            <span>{{ language.text }}</span>
          </div>
        </div>
      </div>
    </div>
  </footer>
</template>
<script setup>
import { ref, computed } from "vue";

// Массив языков с флагами и текстами
const languages = {
  ru: {
    image: "/russia-flag.png", // Путь к флагу России
    text: "RU",
  },
  en: {
    image: "/russia-flag.png", // Путь к флагу США
    text: "ENG",
  },
};

// Текущий язык, по умолчанию русский
const currentLanguage = ref("ru");

// Состояние выпадающего списка
const isDropdownOpen = ref(false);

// Вычисляемое свойство для картинки флага
const currentLanguageImage = computed(
  () => languages[currentLanguage.value].image
);

// Вычисляемое свойство для текста языка
const currentLanguageText = computed(
  () => languages[currentLanguage.value].text
);

// Метод для переключения состояния выпадающего списка
const toggleDropdown = () => {
  isDropdownOpen.value = !isDropdownOpen.value;
};

// Метод для выбора языка
const selectLanguage = (languageCode) => {
  currentLanguage.value = languageCode;
  isDropdownOpen.value = false; // Закрываем дропдаун после выбора языка
};

// Вычисляемое свойство для фильтрации доступных языков (показываем только не выбранный язык)
const availableLanguages = computed(() => {
  return Object.keys(languages)
    .filter((langKey) => langKey !== currentLanguage.value)
    .reduce((obj, langKey) => {
      obj[langKey] = languages[langKey];
      return obj;
    }, {});
});
</script>

<style lang="scss" scoped>
.footer {
  width: 100%;
  max-width: 1300px;
  margin: 0 auto;
  padding: 0 20px;
  padding-bottom: 40px;

  display: flex;
  align-items: center;
  justify-content: space-between;
  gap: 10px;

  &__left {
    width: 100%;
    max-width: 320px;
    display: flex;
    flex-direction: column;
    gap: 10px;

    .play {
      display: flex;
      align-items: center;
      gap: 10px;

      &__age {
        width: 32px;
        height: 32px;
        background-color: #026926;
        border-radius: 8px;
        padding: 20px 20px;

        display: flex;
        align-items: center;
        justify-content: center;
      }

      span {
        color: #0f0e1a;
        font-weight: 600;
        background-color: #32ff7b;
        border-radius: 6px;
        padding: 4px 4px;
      }

      p {
        font-weight: 700;
        font-size: 12px;
        text-transform: uppercase;
        color: #32ff7b;
      }
    }

    P {
      font-weight: 500;
      font-size: 10px;
      color: rgba(255, 255, 255, 0.4);
    }
  }

  &__center {
    width: 100%;
    max-width: 615px;
    display: flex;
    flex-direction: column;
    align-items: start;
    gap: 20px;

    .about {
      display: flex;
      align-items: center;
      gap: 10px;

      h5 {
        font-weight: 600;
        font-size: 12px;
        color: rgba(255, 255, 255, 0.4);
        text-shadow: 1px 1px 1px rgba(0, 0, 0, 0.004);
      }

      p {
        font-weight: 500;
        font-size: 8px;
        color: rgba(255, 255, 255, 0.4);
        max-width: 220px;
      }
    }

    .menu {
      &__items {
        display: flex;
        align-items: center;
        gap: 30px;

        .menu__item {
          list-style: none;
          a {
            font-weight: 500;
            font-size: 12px;
            color: rgba(255, 255, 255, 0.4);
            text-shadow: 1px 1px 1px rgba(0, 0, 0, 0.004);
            text-decoration: none;
            transition: color 0.4s ease-in-out;

            &:hover {
              color: #32ff7b;
            }
          }
        }
      }
    }
  }

  &__right {
    display: flex;
    flex-direction: column;
    gap: 10px;
    .socials {
      &__icons {
        display: flex;
        align-items: center;
        gap: 10px;
      }

      &__icon {
        list-style: none;
      }
    }

    .language-switcher {
      width: 100%;
      max-width: 126px;
      position: relative;

      .language-toggle {
        padding: 8px 10px;
        background-color: #22212e;
        border-radius: 8px;

        display: flex;
        align-items: center;
        justify-content: center;
        gap: 10px;
        cursor: pointer;
        position: relative;

        .arrow {
          display: flex;
        }
      }

      .language-dropdown {
        position: absolute;
        background-color: #22212e;
        padding: 8px 10px;
        width: 100%;

        display: flex;
        flex-direction: column;
        align-items: center;
        justify-content: center;
        gap: 10px;
        top: 35px;
        border-bottom-left-radius: 8px;
        border-bottom-right-radius: 8px;

        .language-option {
          display: flex;
          align-items: center;
          gap: 10px;
        }
      }
      .arrow {
        transition: transform 0.3s ease;
      }

      .arrow.open {
        transform: rotate(180deg); /* Поворот стрелки вверх */
      }
    }
  }
}
</style>
